-- students
INSERT INTO students (full_name, name_pronunciation, nickname, email, area, birth_date, gender, remark, is_deleted) VALUES
('山田 太郎', 'やまだ たろう', 'たろちゃん', 'taro.yamada@example.com', '東京', '1990-05-12', 'Male', 'スポーツが好き', 0),
('鈴木 花子', 'すずき はなこ', 'はなちゃん', 'hanako.suzuki@example.com', '大阪', '1995-10-25', 'Female', '読書が趣味', 0),
('佐藤 健', 'さとう けん', 'けんくん', 'ken.sato@example.com', '福岡', '2005-09-12', 'Male', '', 0),
('高橋 美咲', 'たかはし みさき', 'みさみさ', 'misaki.takahashi@example.com', '北海道', '2000-06-30', 'Female', '旅行が好き', 0),
('中村 俊介', 'なかむら しゅんすけ', 'しゅん', 'shun.nakamura@example.com', '愛知', '2010-03-07', 'Male', '料理が得意', 0);

-- コースマスタ
INSERT INTO courses (course_name, category, duration) VALUES
('Javaコース', '開発系コース', 6),  -- 1
('AWSコース', '開発系コース', 6),  -- 2
('WordPressコース', '制作系コース', 6),  -- 3
('デザインコース', '制作系コース', 6),  -- 4
('webマーケティングコース', '制作系コース', 6),  -- 5
('映像制作コース', '制作系コース', 6),  -- 6
('フロントエンドコース', '開発系コース', 6);  -- 7

-- students_courses
INSERT INTO students_courses (student_id, course_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(3, 6), -- 佐藤 健が複数のコースを受講
(1, 7), -- 山田 太郎が複数のコースを受講
(4, 5); -- 高橋 美咲が複数のコースを受講;

-- ステータスマスタ
INSERT INTO course_statuses (status_name) VALUES
('仮申し込み'),  -- 1
('本申し込み'),  -- 2
('受講開始'),  -- 3
('受講修了'),  -- 4
('中断'),  -- 5
('延長'),  -- 6
('再延長'),  -- 7
('再々延長');  -- 8

-- 受講ステータス履歴情報
INSERT INTO students_courses_status (attending_id, status_id, status_start_date, status_end_date, change_reason) VALUES

-- 山田 太郎 (Javaコース)
(1, 1, '2024-01-01', '2024-01-10', '仮申し込み完了'),
(1, 2, '2024-01-11', '2024-01-15', '本申し込みへ移行'),
(1, 3, '2024-02-01', NULL, '受講開始'),

-- 山田 太郎 (フロントエンドコース)
(7, 1, '2024-03-01', '2024-03-05', '仮申し込み完了'),
(7, 2, '2024-03-06', '2024-03-10', '本申し込みへ移行'),
(7, 3, '2024-03-15', NULL, '受講開始'),

-- 鈴木 花子 (AWSコース)
(2, 1, '2024-02-01', '2024-02-10', '仮申し込み完了'),
(2, 2, '2024-02-11', '2024-02-20', '本申し込みへ移行'),
(2, 3, '2024-03-01', NULL, '受講開始'),

-- 佐藤 健 (WordPressコース)
(3, 1, '2024-04-01', '2024-04-05', '仮申し込み完了'),
(3, 2, '2024-04-06', '2024-04-10', '本申し込みへ移行'),
(3, 3, '2024-04-15', '2024-07-15', '受講開始'),
(3, 4, '2024-07-16', NULL, '受講修了'),

-- 佐藤 健 (映像制作コース)
(6, 1, '2024-08-01', '2024-08-05', '仮申し込み完了'),
(6, 2, '2024-08-06', '2024-08-10', '本申し込みへ移行'),
(6, 3, '2024-08-15', NULL, '受講開始'),

-- 高橋 美咲 (デザインコース)
(4, 1, '2024-05-01', '2024-05-10', '仮申し込み完了'),
(4, 2, '2024-05-11', '2024-05-20', '本申し込みへ移行'),
(4, 3, '2024-06-01', '2024-09-01', '受講開始'),
(4, 5, '2024-09-02', NULL, '一時中断'),

-- 高橋 美咲 (webマーケティングコース)
(8, 1, '2024-06-01', '2024-06-10', '仮申し込み完了'),
(8, 2, '2024-06-11', '2024-06-20', '本申し込みへ移行'),
(8, 3, '2024-07-01', NULL, '受講開始'),

-- 中村 俊介 (映像制作コース)
(5, 1, '2024-07-01', '2024-07-10', '仮申し込み完了'),
(5, 2, '2024-07-11', '2024-07-20', '本申し込みへ移行'),
(5, 3, '2024-08-01', NULL, '受講開始'),
(5, 6, '2025-02-01', NULL, 'コース延長');